Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.UndefinedRooms Property
 There are undefined Rooms in the model! Recommend creating a Room schedule and checking the Area parameter of each Room for warnings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UndefinedRooms { get; }
Public Shared ReadOnly Property UndefinedRooms As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UndefinedRooms {
	FailureDefinitionId^ get ();
}
static member UndefinedRooms : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace